MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32PG12B500F1024GM48/mcu.h
/***************************************************************************//**
 * @file
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFM32PG12B500F1024GM48
 *******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#if defined(__ICCARM__)
#pragma system_include       /* Treat file as system include file. */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang system_header  /* Treat file as system include file. */
#endif

#ifndef EFM32PG12B500F1024GM48_H
#define EFM32PG12B500F1024GM48_H

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup Parts
 * @{
 ******************************************************************************/

/***************************************************************************//**
 * @defgroup EFM32PG12B500F1024GM48 EFM32PG12B500F1024GM48
 * @{
 ******************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn{
/******  Cortex-M4 Processor Exceptions Numbers ********************************************/
  NonMaskableInt_IRQn   = -14,              /*!< 2  Cortex-M4 Non Maskable Interrupt      */
  HardFault_IRQn        = -13,              /*!< 3  Cortex-M4 Hard Fault Interrupt        */
  MemoryManagement_IRQn = -12,              /*!< 4  Cortex-M4 Memory Management Interrupt */
  BusFault_IRQn         = -11,              /*!< 5  Cortex-M4 Bus Fault Interrupt         */
  UsageFault_IRQn       = -10,              /*!< 6  Cortex-M4 Usage Fault Interrupt       */
  SVCall_IRQn           = -5,               /*!< 11 Cortex-M4 SV Call Interrupt           */
  DebugMonitor_IRQn     = -4,               /*!< 12 Cortex-M4 Debug Monitor Interrupt     */
  PendSV_IRQn           = -2,               /*!< 14 Cortex-M4 Pend SV Interrupt           */
  SysTick_IRQn          = -1,               /*!< 15 Cortex-M4 System Tick Interrupt       */

/******  EFM32PG12B Peripheral Interrupt Numbers ********************************************/

  EMU_IRQn              = 0,  /*!< 16+0 EFM32 EMU Interrupt */
  WDOG0_IRQn            = 2,  /*!< 16+2 EFM32 WDOG0 Interrupt */
  WDOG1_IRQn            = 3,  /*!< 16+3 EFM32 WDOG1 Interrupt */
  LDMA_IRQn             = 9,  /*!< 16+9 EFM32 LDMA Interrupt */
  GPIO_EVEN_IRQn        = 10, /*!< 16+10 EFM32 GPIO_EVEN Interrupt */
  TIMER0_IRQn           = 11, /*!< 16+11 EFM32 TIMER0 Interrupt */
  USART0_RX_IRQn        = 12, /*!< 16+12 EFM32 USART0_RX Interrupt */
  USART0_TX_IRQn        = 13, /*!< 16+13 EFM32 USART0_TX Interrupt */
  ACMP0_IRQn            = 14, /*!< 16+14 EFM32 ACMP0 Interrupt */
  ADC0_IRQn             = 15, /*!< 16+15 EFM32 ADC0 Interrupt */
  IDAC0_IRQn            = 16, /*!< 16+16 EFM32 IDAC0 Interrupt */
  I2C0_IRQn             = 17, /*!< 16+17 EFM32 I2C0 Interrupt */
  GPIO_ODD_IRQn         = 18, /*!< 16+18 EFM32 GPIO_ODD Interrupt */
  TIMER1_IRQn           = 19, /*!< 16+19 EFM32 TIMER1 Interrupt */
  USART1_RX_IRQn        = 20, /*!< 16+20 EFM32 USART1_RX Interrupt */
  USART1_TX_IRQn        = 21, /*!< 16+21 EFM32 USART1_TX Interrupt */
  LEUART0_IRQn          = 22, /*!< 16+22 EFM32 LEUART0 Interrupt */
  PCNT0_IRQn            = 23, /*!< 16+23 EFM32 PCNT0 Interrupt */
  CMU_IRQn              = 24, /*!< 16+24 EFM32 CMU Interrupt */
  MSC_IRQn              = 25, /*!< 16+25 EFM32 MSC Interrupt */
  CRYPTO0_IRQn          = 26, /*!< 16+26 EFM32 CRYPTO0 Interrupt */
  LETIMER0_IRQn         = 27, /*!< 16+27 EFM32 LETIMER0 Interrupt */
  RTCC_IRQn             = 30, /*!< 16+30 EFM32 RTCC Interrupt */
  CRYOTIMER_IRQn        = 32, /*!< 16+32 EFM32 CRYOTIMER Interrupt */
  FPUEH_IRQn            = 34, /*!< 16+34 EFM32 FPUEH Interrupt */
  SMU_IRQn              = 35, /*!< 16+35 EFM32 SMU Interrupt */
  WTIMER0_IRQn          = 36, /*!< 16+36 EFM32 WTIMER0 Interrupt */
  WTIMER1_IRQn          = 37, /*!< 16+37 EFM32 WTIMER1 Interrupt */
  PCNT1_IRQn            = 38, /*!< 16+38 EFM32 PCNT1 Interrupt */
  PCNT2_IRQn            = 39, /*!< 16+39 EFM32 PCNT2 Interrupt */
  USART2_RX_IRQn        = 40, /*!< 16+40 EFM32 USART2_RX Interrupt */
  USART2_TX_IRQn        = 41, /*!< 16+41 EFM32 USART2_TX Interrupt */
  I2C1_IRQn             = 42, /*!< 16+42 EFM32 I2C1 Interrupt */
  USART3_RX_IRQn        = 43, /*!< 16+43 EFM32 USART3_RX Interrupt */
  USART3_TX_IRQn        = 44, /*!< 16+44 EFM32 USART3_TX Interrupt */
  VDAC0_IRQn            = 45, /*!< 16+45 EFM32 VDAC0 Interrupt */
  CSEN_IRQn             = 46, /*!< 16+46 EFM32 CSEN Interrupt */
  LESENSE_IRQn          = 47, /*!< 16+47 EFM32 LESENSE Interrupt */
  CRYPTO1_IRQn          = 48, /*!< 16+48 EFM32 CRYPTO1 Interrupt */
  TRNG0_IRQn            = 49, /*!< 16+49 EFM32 TRNG0 Interrupt */
} IRQn_Type;

#define CRYPTO_IRQn               CRYPTO0_IRQn /*!< Alias for CRYPTO0_IRQn */

/***************************************************************************//**
 * @defgroup EFM32PG12B500F1024GM48_Core Core
 * @{
 * @brief Processor and Core Peripheral Section
 ******************************************************************************/
#define __MPU_PRESENT             1U /**< Presence of MPU  */
#define __FPU_PRESENT             1U /**< Presence of FPU  */
#define __VTOR_PRESENT            1U /**< Presence of VTOR register in SCB */
#define __NVIC_PRIO_BITS          3U /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U /**< Is 1 if different SysTick counter is used */

/** @} End of group EFM32PG12B500F1024GM48_Core */

/***************************************************************************//**
 * @defgroup EFM32PG12B500F1024GM48_Part Part
 * @{
 ******************************************************************************/

/** Part family */
#define _EFM32_PEARL_FAMILY                     1  /**< PEARL Gecko MCU Family  */
#define _EFM_DEVICE                                /**< Silicon Labs EFM-type microcontroller */
#define _SILICON_LABS_32B_SERIES_1                 /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES                1  /**< Silicon Labs series number */
#define _SILICON_LABS_32B_SERIES_1_CONFIG_2        /**< Series 1, Configuration 2 */
#define _SILICON_LABS_32B_SERIES_1_CONFIG       2  /**< Series 1, Configuration 2 */
#define _SILICON_LABS_GECKO_INTERNAL_SDID       84 /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_84       /**< Silicon Labs internal use only, may change any time */
#define _SILICON_LABS_32B_PLATFORM_2               /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM              2  /**< @deprecated Silicon Labs platform name */
#define _SILICON_LABS_32B_PLATFORM_2_GEN_2         /**< @deprecated Platform 2, generation 2 */
#define _SILICON_LABS_32B_PLATFORM_2_GEN        2  /**< @deprecated Platform 2, generation 2 */

